; domain
(define (domain grid)
(:requirements :strips :constraints)
(:predicates (pred_1 ?v5 ?v4)
             (pred_3 ?v8 ?v3)
             (pred_10 ?v5 ?v3)
             (pred_4 ?v9 ?v5 )
	     (pred_12 ?v5)
             (pred_6 ?v7)
             (pred_2 ?v8)
             (pred_9 ?v3)
             (pred_5 ?v5)
             (pred_8 ?v8)
             (pred_11 ?v5)
             (pred_7 ))



(:action op_4
:parameters (?v1 ?v12 ?v13 ?v11)
:precondition (and (pred_6 ?v1) (pred_6 ?v12) (pred_2 ?v13) (pred_9 ?v11)
          (pred_1 ?v1 ?v12) (pred_3 ?v13 ?v11)
                   (pred_10 ?v12 ?v11) (pred_12 ?v1) 
                   (pred_5 ?v12) (pred_8 ?v13))
:effect (and  (pred_11 ?v12) (not (pred_5 ?v12))))


(:action op_2
:parameters (?v1 ?v2)
:precondition (and (pred_6 ?v1) (pred_6 ?v2)
               (pred_12 ?v1) (pred_1 ?v1 ?v2) (pred_11 ?v2))
:effect (and (pred_12 ?v2) (not (pred_12 ?v1))))

(:action op_1
:parameters (?v1 ?v13)
:precondition (and (pred_6 ?v1) (pred_2 ?v13) 
                  (pred_12 ?v1) (pred_4 ?v13 ?v1) (pred_7 ))
:effect (and (pred_8 ?v13)
   (not (pred_4 ?v13 ?v1)) (not (pred_7 ))))


(:action op_5
:parameters (?v1 ?v6 ?v10)
:precondition (and (pred_6 ?v1) (pred_2 ?v6) (pred_2 ?v10)
                  (pred_12 ?v1) (pred_8 ?v10) (pred_4 ?v6 ?v1))
:effect (and (pred_8 ?v6) (pred_4 ?v10 ?v1)
        (not (pred_8 ?v10)) (not (pred_4 ?v6 ?v1))))

(:action op_3
:parameters (?v1 ?v13)
:precondition (and (pred_6 ?v1) (pred_2 ?v13) 
                  (pred_12 ?v1) (pred_8 ?v13))
:effect (and (pred_7 ) (pred_4 ?v13 ?v1) (not (pred_8 ?v13)))))

; problem
(define (problem grid-3-3-2-2-2)
    (:domain grid)
    (:objects
    obj_03 obj_11 obj_01 obj_10 obj_07 obj_04 obj_02 obj_12 obj_05
    obj_08 obj_09
    obj_06 obj_13
    )

    (:init
       (pred_7)

       (pred_6 obj_03)
       (pred_6 obj_11)
       (pred_6 obj_01)
       (pred_6 obj_10)
       (pred_6 obj_07)
       (pred_6 obj_04)
       (pred_6 obj_02)
       (pred_6 obj_12)
       (pred_6 obj_05)
       (pred_9 obj_08)
       (pred_9 obj_09)
       (pred_2 obj_06)
       (pred_2 obj_13)

       (pred_1 obj_03 obj_10)
       (pred_1 obj_03 obj_11)
       (pred_1 obj_11 obj_07)
       (pred_1 obj_11 obj_01)
       (pred_1 obj_11 obj_03)
       (pred_1 obj_01 obj_04)
       (pred_1 obj_01 obj_11)
       (pred_1 obj_10 obj_02)
       (pred_1 obj_10 obj_07)
       (pred_1 obj_10 obj_03)
       (pred_1 obj_07 obj_12)
       (pred_1 obj_07 obj_04)
       (pred_1 obj_07 obj_11)
       (pred_1 obj_07 obj_10)
       (pred_1 obj_04 obj_05)
       (pred_1 obj_04 obj_01)
       (pred_1 obj_04 obj_07)
       (pred_1 obj_02 obj_12)
       (pred_1 obj_02 obj_10)
       (pred_1 obj_12 obj_05)
       (pred_1 obj_12 obj_07)
       (pred_1 obj_12 obj_02)
       (pred_1 obj_05 obj_04)
       (pred_1 obj_05 obj_12)
       (pred_5 obj_04)
       (pred_5 obj_05)
       (pred_10  obj_04 obj_08)
       (pred_10  obj_05 obj_09)
       (pred_11 obj_03)
       (pred_11 obj_11)
       (pred_11 obj_01)
       (pred_11 obj_10)
       (pred_11 obj_07)
       (pred_11 obj_02)
       (pred_11 obj_12)

       (pred_3  obj_06 obj_08)
       (pred_3  obj_13 obj_09)
       (pred_4 obj_06 obj_12)
       (pred_4 obj_13 obj_01)
       (pred_12 obj_11)
    )

    (:goal (and
       (pred_4 obj_13 obj_10)
    ))
(:constraints
  (always (not (pred_12 obj_03)))
)
)

; plan
1. (op_2 obj_11 obj_01)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_01)
   goals met: 0 of 1
2. (op_1 obj_01 obj_13)
   deleted: (pred_4 obj_13 obj_01) (pred_7)
   added: (pred_8 obj_13)
   goals met: 0 of 1
3. (op_2 obj_01 obj_11)
   deleted: (pred_12 obj_01)
   added: (pred_12 obj_11)
   goals met: 0 of 1
4. (op_2 obj_11 obj_07)
   deleted: (pred_12 obj_11)
   added: (pred_12 obj_07)
   goals met: 0 of 1
5. (op_2 obj_07 obj_10)
   deleted: (pred_12 obj_07)
   added: (pred_12 obj_10)
   goals met: 0 of 1
6. (op_3 obj_10 obj_13)
   deleted: (pred_8 obj_13)
   added: (pred_7) (pred_4 obj_13 obj_10)
   goals met: 1 of 1
